1) Реализуйте конвертор валют. Пользователь вводит доллары, программа переводит 
в евро. Курс валюты храните в константе.
2) Делить число 1000 на 2 до тех пор, пока не получится число меньше 50. Вывести 
это число и сколько делений произвели.
3) Дано число 100. Необходимо посчитать сумму от 0 до 100 (либо наоборот, от 100 
до 0).
В итоге у вас должно получится значение 5050.
Сохраните итоговое значение в переменную sum и выведите его на экран при помощи 
alert.
4) Пользователь вводит год своего рождения, вывести информацию о возрасте 
пользователя в разные года до текущего.
Например, вводим «2003». Вывод: «в 2003 было 0 год», «в 2004 было 1 год», «в 2005 
было 2 год» и т.д.
5) 
Решить циклом
Пользователь вводит сумму денег в кошельке и цену одной шоколадки. Программа 
выводит сколько шоколадок может купить пользователь и сколько сдачи у него 
останется.